let tekstPolje = document.getElementById("tekst");
let tekst = [
    "Седам чуда се први пут помињу око 450. пре н. е., када је грчки историчар Херодот саставио списак грађевина којима су се дивили, а међу њима су биле пирамиде у Гизи и Висећи вртови. Исто су учинили и византијски филозоф Филон, око 225. пре н. е., и грчки писац Антипатер из Сидона, око 130. пре н. е. На њиховим пописима први пут је заједно споменуто свих седам грађевина које су данас познате као седам светских чуда старог света.Стари Грци су тај списак назвали Седам атракција насељене Земље које треба обавезно видети и односе се на скуп архитектонских дела за која су сматрали врхунцем људске креативности и генијалности. Од свих тада изабраних чуда, данас једино можемо видети Велику пирамиду у Египту.",
    "Артемидин храм или Артемисион се налазио у Ефесу, а био је посвећен грчкој богињи Артемиди. У процесу градње учествовали су најситакнутији уметници тог доба. Годинама након изградње храм су посећивали и други уметници, занатлије, трговци и туристи. Несумњиво је био центар збивања свих слојева друштва, а чак је откривено да су ходочасници из далеке Индије и Персије посећивали храм и остављали разноразне поклоне у част Артемиде. Човек по имену Херостратус је 356. године п. н. е. у намери да његово име остане славно у историји запалио храм. Он је сагорео до темеља, те данас можемо видети само остатке. Посебно је занимљиво што је те исте ноћи рођен Александар Велики. Ову необичну случајност описао је и познати историчар тог доба, Плутарх: У тој ноћи богиња није обитавала у свом храму, јер је присуствовала рођењу будућег великог војсковође, те није могла да спаси свој храм од уништења. У наредне две деценије храм је обновљен, а још једна невероватна случајност је да у процесу значајно помогао Александар Велики.",
    "Велика пирамида познатија је као Кеопсова пирамида и налази се у Египту. Она је најстарија од три пирамиде у Гизи, а уједно и највећа пирамида на свету. Од седам светских чуда антике, Велика пирамида је једина очувана. Пирамида је заправо гробница египатских фараона, коју је градило више од 100.000 људи. У сржи пирамида лежи идеја о степеништу путем ког ће фараон наћи пут до неба где ће његова душа пронаћи спокој. Египћани су архитекте који су радили на пројектовању пирамиде проглашавали богом, из чега се закључује колико су поштовање изражавали према овој грађевини. Она је поред гробница уједно и доказ одличног познавања геометрије, математике и астрономије Египћана.",
    "Вртови из Вавилона познати су још као Семирамидини висећи вртови. Постоји мит да је краљ Набукодоносор око 600. године п. н. е. наредио да се изграде вртови на терасама палате у жељи да орасположи краљицу Семирамиду. Остаци висећих вртова у Вавилону налазе се на источној обали реке Еуфрат, на око 50 км јужно од Багдада, у Ираку. Детаљни описи висећих вртова пронађени су у делима грчких историчара Бероса и Диодора. Запањујућа је чињеница да ипак не постоје докази да су вртови икада постојали, иако су у људској машти несумњиво проналазили пут до необичног и задивљујућег.",
    "Јасно је да се ради о грађевини посвећеној грчком богу Зевсу – врховном богу старих Грка у чију част су се одржавале Олимпијске игре. Статуа се налазила у највећем храму старог света. Грци се нису штедели када су симболичне скулптуре у питању, па су поред гигантског Колоса са Родоса подигли и статуу у част најпоштованијем богу. Био је огромних размера – његова основа била је широка 6,5 метара, а висина статуе била је 13 метара. Кип је коштао читаво богатство и био је направљен од разних драгоцених материјала, укључујући слоновачу и злато. Статуа приказује Зевса како седи на свом престолу, а многи посетиоци су веровали да су видели самога Бога. Нажалост, данас не можемо да видимо поменуто достигнуће, али ипак остаје сазнање о њиховој изврсној архитектури.",
    "Колос са Родоса је без сумње непоновљива грађевина. Ова гигантска статуа била је симбол јединства народа који је насељавао Родос. Налазила се на самом улазу у луку Митраки, острво Родос у Грчкој. На острву су тада постојала три града-државе, полиси. Антагониди из Македоније су били велики ривали птоломејима и напали су Родос у покушају да сломе његову алијансу са Египтом. Када је постигнут мировни споразум 304. године п. н. е. Антагониди су се повукли остављајући за собом велику количину ратне опреме. Становници Родоса су одлучили да ту ратну опрему продају и да новац искористе за славље. Ипак, они нису на уобичајен начин прослављали мир. Одлучили су да подигну огромну статуу посвећену грчком богу Сунца – Хелиосу. Изградња је трајала 12 година, а статуа је срушена услед земљотреса који је погодио Родос 226. године п. н. е. Око 1000 година статуа је лежала поломљена. А када су Арапи напали Родос, искористили су прилику да узму остатке поломљене статуе и продају их Сирији. Иако је од градње статуе до њеног уништења прошло само 56 година, она је за то релативно кратко време успела да остави вечни печат у историји импресивних грађевина.",
    "Светионик је направљен између 300. и 280. године п. н. е. на полуострву Фарос. Не ради се само о светском чуду лепоте, већ и корисности. Светионик је омогућавао безбедан повратак бродова у луку Александрију. Недуго након смрти Александра Македонског, његов намесник Птолемеј И Сотер преузео је власт над Египтом. Подигао је и узео за своју престоницу Александрију у чијој се близини налази острво Фарос, а за чије име се верује да потиче од речи Пхарао’с, што значи фараоново острво. У то време, светионик је био највећа грађевина света а његова светлост се могла видети на 50 км од александријске обале. Чак и данас, после невероватних архитектонских напора, Фарос је остао највећи светионик са својим димензијама. Био је посвећен боговима спаситељима, Птоломеју Сотеру и његовој жени Береници.",
    "Ово светско чудо старог света сматра се једним од највећих достигнућа античке уметности. У питању је надгробни споменик каријског краља Маузола. Грађевина је постојала од 350. године пре нове ере, па све до 15. века. Изгледа да су нека светска чуда делила исту судбину, јер је и Маузолеј срушен када га је погодио снажан земљотрес, као и Колос са Родоса. Ипак, мермерни блокови и остаци маузолеја су искориштени у друге сврхе, тако да се и данас могу видети. Ово светско чудо старог света сматра се једним од највећих достигнућа античке уметности. У питању је надгробни споменик каријског краља Маузола. Грађевина је постојала од 350. године пре нове ере, па све до 15. века. Изгледа да су нека светска чуда делила исту судбину, јер је и Маузолеј срушен када га је погодио снажан земљотрес, као и Колос са Родоса. Ипак, мермерни блокови и остаци маузолеја су искориштени у друге сврхе, тако да се и данас могу видети.",
    "Колосеум је највећи амфитеатар на свету, а изграђен је за свега 10 година. За новац који је утрошен на изградњу Колосеума, могао се изградити један мањи град. Али, да је било тако, ми данас не бисмо имали прилику да ушетамо у центар некадашњих гладијаторских борби. Испод амфитеатра су смештене бројне собе и поџемни пролази. У њима су били смештени гладијатори и животиње, чекајући свој судбоносни тренутак у арени. Ово што данас видимо само је трећина оригиналне грађевине. Једна група научника сматра Колосеум местом страдања великог броја верника током прогона хришћана у Римском царству, док су други научници става да се највећи део страдања догодио на другим местима. Колосеум данас непобитно спада у најлепше културне центре целе Европе, а за разлику од претходних чуда, налази се најближе нама, у вечномРиму. Колосеум је не само симбол града, већ целе Италије.",
    "Таџ Махал је уједно симбол љубави и бола и изврсне архитектуре. Ову, данас веома популарну грађевину која се налази у Индији, изградио је Шах Џахан у част своје супруге која је преминула приликом рађања њиховог четнаестог детета. Могул је наредио да се изнад гроба његове жене сазида гробница какву свет није видео. Он је успео у својој намери, јер Таџ Махал поносно носи епитет драгуљ исламске уметности не само због повода услед ког је изграђен, већ и због невероватног архитектонског достигнућа постигнутог приликом градње. Реч је о могулској архитектури – комбинацији персијских, индијских и исламских архитектонских стилова. Изграђен је средином 17. века а чак 22000 радника и уметника је учествовало у градњи. Одише невероватном лепотом и споља и изнутра."
]

tekstPolje.innerHTML = tekst[0]




function slika1(){
    document.getElementById("tekst").value = "Tekst1"
    document.getElementById("velika").src = "./slike/slika1.jpg"
    tekstPolje.innerHTML= tekst[0]
}

function slika2(){
    document.getElementById("tekst").value = "Tekst2"
    document.getElementById("velika").src = "./slike/slika2.jpg"
    tekstPolje.innerHTML= tekst[1]
}

function slika3(){
    document.getElementById("tekst").value = "Tekst3"
    document.getElementById("velika").src = "./slike/slika3.jpg"
    tekstPolje.innerHTML= tekst[2]
}

function slika4(){
    document.getElementById("tekst").value = "Tekst4"
    document.getElementById("velika").src = "./slike/slika4.jpg"
    tekstPolje.innerHTML= tekst[3]
}

function slika5(){
    document.getElementById("tekst").value = "Tekst5"
    document.getElementById("velika").src = "./slike/slika5.jpg"
    tekstPolje.innerHTML= tekst[4]
}

function slika6(){
    document.getElementById("tekst").value = "Tekst6"
    document.getElementById("velika").src = "./slike/slika6.jpg"
    tekstPolje.innerHTML= tekst[5]
}

function slika7(){
    document.getElementById("tekst").value = "Tekst7"
    document.getElementById("velika").src = "./slike/slika7.jpg"
    tekstPolje.innerHTML= tekst[6]
}

function slika8(){
    document.getElementById("tekst").value = "Tekst8"
    document.getElementById("velika").src = "./slike/slika8.jpg"
    tekstPolje.innerHTML= tekst[7]
}

function slika9(){
    document.getElementById("tekst").value = "Tekst9"
    document.getElementById("velika").src = "./slike/slika9.jpg"
    tekstPolje.innerHTML= tekst[8]
}

function slika10(){
    document.getElementById("tekst").value = "Tekst10"
    document.getElementById("velika").src = "./slike/slika10.jpg"
    tekstPolje.innerHTML= tekst[9]
}

document.getElementById("uputstvo").addEventListener("click", ()=>{
    window.location.href = "uputstvo.html"
})

document.getElementById("autor").addEventListener("click", ()=>{
    window.location.href = "oautoru.html"
})